#include <stdio.h>  // то же самое что и import в питончике
// без неё у нас нет даже put, get, printf и даже +/-/*
// скачиваем базовый функционал из стандартной библиотеки
void my_function();

// языки программирования делятся на 2 типа: компилируемые и интерпретируемые
// компилируемые - это те, которые сначала компилируются в машинный код, а потом уже выполняются (язык C)
// интерпретируемые - это те, которые сразу же выполняются (язык Python)


// комплятору необходима функция main, с которой он начинает выполнение программы
// основыне типы данных в языке C: int(число целое), char(1 символ), float(дробное число), void(ничего)

// в начале каждой функции указывается тип возвращаемого значения, если функция ничего не возвращает, то пишется void
int main() {
	puts("Hello, World!");  // put - выводит текст в консоль
	my_function();  // вызываем функцию my_function
	return 0;  // возвращаем 0, что означает успешное завершение программы
}

void my_function() {
	// это функция, которая ничего не возвращает(ничего не выплевывает, а просто пишет текст)
	puts("This is my function!");
	puts("It does not return anything.");
}


// гайд по гитхабу
// 0. скачиваем гит https://git-scm.com/install/windows (должен появиться git Bash)
// 1. Создаём репозиторий на гитхабе
// 2. переходим в папку с проектом
// cd путь_к_проекту
// cd C:/Users/Romochka/source/repos/test_c_code/test_c_code
// 3. git init (инициализация репозитория)
// 4. если первый раз работает с гитхабом, то нужно настроить имя и почту
//git config --global user.name "Ваше Имя"
//git config --global user.email "your@email.com"

// приступаем к работе с гитом

// 5. git add . (скачиваем все файл в наш гит на компьютере)
// 6. git commit -m "Первая установка гитхаба" 



